app/controllers/games_controller.rb

  def create
    @game = Game.create!
---
INSERT INTO "games" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2024-04-16 19:04:19.676273"], ["updated_at", "2024-04-16 19:04:19.676273"]]

  def update
    knocked_pins = params[:pins_knocked_down].to_i
    frame_number = params[:frame_number].to_i

    @game.input_pins(knocked_pins, frame_number)
    render json: {
      id: @game.id,
      total_score: @game.total_score,
      frames: @game.frames.order(number: :DESC).map do |frame|
---
SELECT COUNT(*) FROM "frames" WHERE "frames"."game_id" = $1  [["game_id", 3]]
SELECT "frames".* FROM "frames" WHERE "frames"."game_id" = $1 ORDER BY "frames"."number" DESC  [["game_id", 9]]

  def show
    game_details = {
      id: @game.id,
      total_score: @game.total_score,
      frames: @game.frames.order(number: :DESC).where(status: "completed").map do |frame|
---
SELECT "frames".* FROM "frames" WHERE "frames"."game_id" = $1 AND "frames"."status" = $2 ORDER BY "frames"."number" DESC  [["game_id", 9], ["status", "completed"]]