app/models/frame.rb

SELECT "frames".* FROM "frames" WHERE "frames"."game_id" = $1 AND "frames"."status" = $2 LIMIT $3  [["game_id", 6], ["status", "pending strike score"], ["LIMIT", 1]]
UPDATE "frames" SET "next_roll_pins" = $1 WHERE "frames"."id" = $2  [["next_roll_pins", 1], ["id", 46]]
UPDATE "frames" SET "next_roll_pins" = $1 WHERE "frames"."id" = $2  [["next_roll_pins", 1], ["id", 210]]
UPDATE "frames" SET "status" = $1 WHERE "frames"."id" = $2  [["status", "completed"], ["id", 46]]
UPDATE "frames" SET "score" = $1 WHERE "frames"."id" = $2  [["score", 20], ["id", 25]]
---
  def pending_strike_score
   @last_frame = self.game.frames.find_by(status: "pending strike score")
    if @last_frame.present? && (@last_frame.number != self.number || @last_frame.number ==10 )
      if self.rolls_taken == 1
        last_frame_score = @last_frame.score + self.knocked_pins
      elsif self.rolls_taken == 2
        last_frame_score = @last_frame.score + self.knocked_pins - self.ball_1_knocked_pins
      end

      @last_frame.update_column(:score, last_frame_score)
      if @last_frame.next_roll_pins > 0
         @last_frame.update_column(:next_roll_pins, @last_frame.next_roll_pins-1)
         @last_frame.update_column(:status, "completed") if @last_frame.next_roll_pins == 0
      elsif
        @last_frame.update_column(:status, "completed")

SELECT "frames".* FROM "frames" WHERE "frames"."game_id" = $1 AND "frames"."status" = $2 LIMIT $3  [["game_id", 24], ["status", "pending spare score"], ["LIMIT", 1]]
SELECT "frames".* FROM "frames" WHERE "frames"."game_id" = $1 AND "frames"."status" = $2 LIMIT $3  [["game_id", 26], ["status", "pending spare score"], ["LIMIT", 1]]
UPDATE "frames" SET "next_roll_pins" = $1 WHERE "frames"."id" = $2  [["next_roll_pins", 0], ["id", 33]]
UPDATE "frames" SET "next_roll_pins" = $1 WHERE "frames"."id" = $2  [["next_roll_pins", 0], ["id", 155]]
UPDATE "frames" SET "score" = $1 WHERE "frames"."id" = $2  [["score", 20], ["id", 285]]
---
  def pending_spare_score
    @last_frame = self.game.frames.find_by(status: "pending spare score")
    if @last_frame.present? && self.rolls_taken == 1 && @last_frame.next_roll_pins == 1
      last_frame_score = @last_frame.score + self.knocked_pins
      @last_frame.update_column(:score, last_frame_score)
      @last_frame.update_column(:status, "completed")
      @last_frame.update_column(:next_roll_pins, 0)