app/models/game.rb

INSERT INTO "frames" ("number", "game_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["number", 1], ["game_id", 2], ["created_at", "2024-04-17 03:35:07.478385"], ["updated_at", "2024-04-17 03:35:07.478385"]]
---
  def start_new_game
    (1..10).each do |frame_number|
      frames.create(number: frame_number)

UPDATE "frames" SET "knocked_pins" = $1, "updated_at" = $2, "rolls_taken" = $3 WHERE "frames"."id" = $4  [["knocked_pins", 4], ["updated_at", "2024-04-21 18:16:05.297569"], ["rolls_taken", 1], ["id", 22]]
UPDATE "frames" SET "ball_1_knocked_pins" = $1, "knocked_pins" = $2, "rolls_taken" = $3, "updated_at" = $4 WHERE "frames"."id" = $5  [["ball_1_knocked_pins", 5], ["knocked_pins", 10], ["rolls_taken", 2], ["updated_at", "2024-04-22 05:57:05.821007"], ["id", 53]]
---
  def input_pins(knocked_pins, frame_number)
    current_frame = frames.find_by(number:frame_number, status:"active")  || frames.find_by(number:10)
    return unless current_frame
    if current_frame.ball_1_knocked_pins.nil?
      current_frame.ball_1_knocked_pins = knocked_pins
    elsif current_frame.ball_2_knocked_pins.nil?
      current_frame.ball_2_knocked_pins = knocked_pins
    else
      current_frame.ball_3_knocked_pins = knocked_pins
    end
    current_frame.knocked_pins = current_frame.knocked_pins + knocked_pins
    current_frame.update_rolls_taken
    current_frame.save!